In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.1.3'

## 1) Création d'un dataframe à partir d'un dico

In [3]:
métiers = ["journaliste", "capitaine"]
noms = ["Tintin", "Haddock"]
personnages = {"métiers" : métiers,
               "noms" : noms}

In [4]:
personnages

{'métiers': ['journaliste', 'capitaine'], 'noms': ['Tintin', 'Haddock']}

In [5]:
df = pd.DataFrame(personnages)

In [6]:
df

       métiers     noms
0  journaliste   Tintin
1    capitaine  Haddock

In [7]:
df.shape

(2, 2)

In [8]:
df.columns

Index(['métiers', 'noms'], dtype='object')

In [9]:
df.index

RangeIndex(start=0, stop=2, step=1)

In [11]:
df.index.name

In [12]:
df.index.name = "numéro"

In [13]:
df

            métiers     noms
numéro
0       journaliste   Tintin
1         capitaine  Haddock

In [14]:
pd.read_csv("https://raw.githubusercontent.com/romainjouin/formation_python/master/cyclistes.csv")

       id sexe  sportivite  age  sur_velo
0     101    F   -0.285718   66      True
1     102    H    2.219441   37      True
2     103    F    2.637251   49      True
3     104    F    1.413551   33      True
4     105    H   -1.331255   36      True
..    ...  ...         ...  ...       ...
995  1096    H    1.207463   80      True
996  1097    H    1.651872   47      True
997  1098    H    4.415284   40     False
998  1099    F    0.205798   77      True
999  1100    F    6.929330   70      True

[1000 rows x 5 columns]